
Story.destroy_all
puts "Удаление всех постов"

# stories = [
# {
# 	name: "В какой период растение нуждается в пересадке?",
# 	title: "В какой период растение нуждается в пересадке?",
# 	sort: "Почва",
# 	content: "Могу посоветовать прищипывать её весной! Новые веточки обязательно зацветают. Удалять подвядшие бутоны! И, конечно, надо подкармливать удобрениями для цветения. Горшок лучше небольшой, диаметром 10 см. Азотными удобрениями (точнее, комплексными, но с повышенным содержанием азота) можно и нужно пользоваться, но в период роста: ранней весной или когда вы подращиваете черенки.
#
# А после появления бутонов нужно переходить на цветочные (т.е. с повышенным содержанием фосфора и калия). Вот тут Покон - просто находка! Еще на западных сайтах пишут, что очень хороши удобрения для томатов. Можно испоьзовать для перцев и томатов и чередовать ее с Поконом. А еще они очень любят, чтобы ими восхищались. :-) Кроме того, фуксия уважает прохладную зимовку при максимуме света, пересадку весной в хорошую землю (типа: с огуречных грядок), потом - обрезку на 1-3, просторное и очень светлое место - и не поворачивать, когда она готовится к цветению, а то сбросит бутоны.",
# 	picture: File.open(Rails.root.join('public', 'images', 'first.png')),
# 	remark: "Хорошо известно, что ничто не растёт само по себе. Культурным растениям требуется уход, одним из важнейших мероприятий которого является их влагообеспечение."
# }]
#
# Stories.each do |story|
# 	postik = Story.create(story)
# 	puts "Новая статья '#{ postik.name }' с id!"
# end
